app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "s96"], ["email", "s96@email.com"], ["password", "s96543"], ["created_at", "2021-03-03 20:14:04.947247"], ["updated_at", "2021-03-03 20:14:04.947247"]]
---
    def create
        @user = User.new(user_params)

        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "s967"], ["email", "s967@email.com"], ["password", "s96754"], ["updated_at", "2021-03-03 20:58:12.953110"], ["id", 2]]
---
    def update
        @user = User.find(params[:id])

        if @user.update(user_params)